{
    "symptoms": "Common symptoms of diabetes include increased thirst, frequent urination, unexplained weight loss, extreme hunger, blurry vision, slow-healing sores, and frequent infections.",
    "types": "There are mainly three types of diabetes: Type 1 (the body doesn't produce insulin), Type 2 (the body doesn't use insulin properly), and Gestational diabetes (occurs during pregnancy).",
    "causes": "Type 1 diabetes is believed to be caused by an autoimmune reaction. Type 2 diabetes is often linked to genetics and lifestyle factors such as obesity and lack of exercise.",
    "treatment": "Diabetes treatment may include monitoring blood sugar, insulin therapy, medications, diet management, and regular exercise. The specific treatment depends on the type of diabetes.",
    "prevention": "While Type 1 diabetes cannot be prevented, Type 2 diabetes can often be prevented or delayed through maintaining a healthy weight, regular exercise, and a balanced diet.",
    "complications": "Diabetes can lead to various complications including heart disease, kidney damage, nerve damage (neuropathy), eye damage, foot problems, and skin conditions.",
    "diet": "A diabetes-friendly diet typically includes whole grains, lean proteins, fruits, vegetables, and healthy fats while limiting sugars and refined carbohydrates.",
    "exercise": "Regular physical activity is crucial for managing diabetes. It helps control blood sugar levels, reduces cardiovascular risk, and contributes to weight management.",
    "blood pressure": "High blood pressure is common in people with diabetes and can increase the risk of diabetes complications. It's important to monitor and control blood pressure.",
    "dizziness": "Dizziness can be a symptom of diabetes, particularly if blood sugar levels are too high or too low. It's important to monitor blood sugar and consult with a healthcare provider if experiencing frequent dizziness.",
    "insulin": "Insulin is a hormone produced by the pancreas that allows your body to use sugar (glucose) from carbohydrates in the food that you eat for energy or to store glucose for future use.",
    "glucose": "Glucose is a simple sugar that is an important energy source in living organisms and is a component of many carbohydrates. Blood glucose levels are tightly regulated in the human body.",
    "a1c test": "The A1C test is a blood test that provides information about a person's average levels of blood glucose over the past 3 months. It's used to diagnose diabetes and gauge how well a person is managing their diabetes.",
    "ketoacidosis": "Diabetic ketoacidosis is a serious complication of diabetes that occurs when your body produces high levels of blood acids called ketones. It can occur when your body can't produce enough insulin.",
    "neuropathy": "Diabetic neuropathy is a type of nerve damage that can occur if you have diabetes. High blood sugar can injure nerve fibers throughout your body, but diabetic neuropathy most often damages nerves in your legs and feet.",
    "retinopathy": "Diabetic retinopathy is a diabetes complication that affects eyes. It's caused by damage to the blood vessels of the light-sensitive tissue at the back of the eye (retina).",
    "nephropathy": "Diabetic nephropathy is a type of progressive kidney disease caused by damage to the capillaries in the kidneys' glomeruli. It's a serious complication of both type 1 and type 2 diabetes.",
    "hypoglycemia": "Hypoglycemia is a condition characterized by abnormally low blood glucose (blood sugar) levels, usually less than 70 mg/dl. It's often a side effect of diabetes treatment.",
    "hyperglycemia": "Hyperglycemia is the technical term for high blood glucose (blood sugar). It occurs when the body has too little insulin or when the body can't use insulin properly.",
    "gestational diabetes": "Gestational diabetes is a type of diabetes that develops during pregnancy in women who didn't already have diabetes. It usually goes away after the baby is born but increases the risk for type 2 diabetes later in life.",
    "pancreas": "The pancreas is an organ located in the abdomen that plays an essential role in converting the food we eat into fuel for the body's cells. It produces insulin and other important enzymes and hormones that help break down foods.",
    "carbohydrate counting": "Carbohydrate counting is a meal planning technique for managing blood glucose levels in diabetes. It involves tracking the amount of carbohydrate in the foods you eat each day.",
    "diabetes management": "Diabetes management refers to the practices and techniques used to control blood sugar levels and prevent complications. This includes monitoring glucose levels, taking medications, following a healthy diet, and exercising regularly.",
    "prediabetes": "Prediabetes is a condition where blood sugar levels are higher than normal, but not high enough yet to be diagnosed as type 2 diabetes. It's often a warning sign that you're at risk for developing type 2 diabetes.",
    "insulin resistance": "Insulin resistance is when cells in your muscles, fat, and liver don't respond well to insulin and can't easily take up glucose from your blood. As a result, your pancreas makes more insulin to help glucose enter your cells.",
    "diabetes in children": "Diabetes can affect children of any age. Type 1 diabetes is more common in children, while type 2 diabetes, once rare in young people, is becoming more common. Symptoms and management strategies may differ from those for adults."
}